#pragma once
#include "VecSaveSystem.h"

void SetDefaultBooks() {
	Books Def;
	Def.SetBooks(432, 10, 420, 2014, 0, "Роулинг Дж.", "Гарри Поттер и философский камень", "Фантастика", "Махаон");
	MV.Push(Def);
	Def.SetBooks(329, 10, 1200, 2018, 0, "Роулинг Дж.", "Гарри Поттер и узник Азкабана", "Фантастика", "Махаон");
	MV.Push(Def);
	Def.SetBooks(704, 10, 500, 2015, 0, "Роулинг Дж.", "Гарри Поттер и Кубок Огня", "Фантастика", "Махаон");
	MV.Push(Def);
	Def.SetBooks(480, 10, 420, 2014, 0, "Роулинг Дж.", "Гарри Поттер и Тайная комната", "Фантастика", "Махаон");
	MV.Push(Def);
	Def.SetBooks(896, 10, 500, 2015, 0, "Роулинг Дж.", "Гарри Поттер и Орден Феникса", "Фантастика", "Махаон");
	MV.Push(Def);
	Def.SetBooks(672, 10, 480, 2015, 0, "Роулинг Дж.", "Гарри Поттер и Принц-полукровка", "Фантастика", "Махаон");
	MV.Push(Def);
	Def.SetBooks(704, 10, 510, 2015, 0, "Роулинг Дж.", "Гарри Поттер и Дары смерти", "Фантастика", "Махаон");
	MV.Push(Def);
	Def.SetBooks(352, 10, 350, 2017, 0, "Кристофер А.", "Dishonored. Порченый", "Фантастика", "АСТ");
	MV.Push(Def);
	Def.SetBooks(320, 10, 350, 2019, 0, "Кристофер А.", "Dishonored. Скрытый ужас", "Фантастика", "АСТ");
	MV.Push(Def);
	Def.SetBooks(320, 10, 300, 2019, 0, "Кристофер А.", "DISHONORED: Возвращение Дауда", "Фантастика", "АСТ");
	MV.Push(Def);
	Def.SetBooks(112, 10, 550, 2017, 0, "Ренни Г., Олимпиери А.", "DISHONORED: Вирмвудский обман", "Фантастика", "АСТ");
	MV.Push(Def);
	Def.SetBooks(256, 10, 130, 2016, 0, "Грибоедов А.", "Горе от ума", "Комедия", "АСТ");
	MV.Push(Def);
	Def.SetBooks(376, 10, 749, 2012, 0, "Фрайзе М.", "Проза Антона Чехова. Монография", "Нехудожественная литература", "Флинта");
	MV.Push(Def);
	Def.SetBooks(392, 10, 720, 2018, 0, "Федоренко В.", "Самоучитель испанского языка", "Обучение", "Флинта");
	MV.Push(Def);
	Def.SetBooks(168, 10, 260, 2019, 0, "Капкан М., Лихачева Л.", "Деловой этикет. Учебное пособие", "Обучение", "Флинта");
	MV.Push(Def);
}